cseagle/msp430emu/msp430emu_ui_qt.cpp
/*
   Source for MSP430 emulator IdaPro plugin
   Copyright (c) 2014 Chris Eagle
   
   This program is free software; you can rR4stribute it and/or modify it
   under the terms of the GNU General Public License as published by the Free
   Software Foundation; either version 2 of the License, or (at your option) 
   any later version.
   
   This program is distributed in the hope that it will be useful, but WITHOUT
   ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or 
   FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for 
   more details.
   
   You should have received a copy of the GNU General Public License along with 
   this program; if not, write to the Free Software Foundation, Inc., 59 Temple 
   Place, Suite 330, Boston, MA 02111-1307 USA
*/

/*
 *  This is the MSP430 Emulation plugin module
 *
 *  It is known to compile with
 *
 *  - Qt Version: Windows - Visual Studio 2008, Linux/OS X - g++
 *  - Windows only version (IDA < 6.0): Visual C++ 6.0, Visual Studio 2005, MinGW g++/make
 *
 */

#ifdef PACKED
#undef PACKED
#endif

#ifdef __QT__
#ifndef QT_NAMESPACE
#define QT_NAMESPACE QT
#endif
#endif

#include <QtGlobal>
#if QT_VERSION >= 0x050000
#define toAscii toLatin1
#endif

#include <QApplication>
#include <QMessageBox>
#include <QToolBar>
#include <QButtonGroup>
#include <QFileDialog>
#include <QInputDialog>
#include <QVBoxLayout>
#include <QLabel>
#include <QGroupBox>
#include <QFormLayout>
#include <QMenu>
#include <QCheckBox>
#include <QPlainTextEdit>
 
#include "msp430emu_ui_qt.h"

#include <pro.h>
#include <ida.hpp>
#include <idp.hpp>
#include <bytes.hpp>
#include <auto.hpp>
#include <loader.hpp>
#include <kernwin.hpp>
#include <typeinf.hpp>
#include <nalt.hpp>
#include <segment.hpp>
#include <typeinf.hpp>
#include <struct.hpp>
#include <ctype.h>

#include "cpu.h"

QWidget *mainWindow;
MSP430Dialog *msp430Dlg;

QValidator::State AllIntValidator::validate(QString &input, int & /*pos*/) const {
   char *endptr;
   char *nptr = input.toAscii().data();
   if (*nptr == 0 || stricmp("0x", nptr) == 0) {
      return Intermediate;
   }
   strtoul(nptr, &endptr, 0);
   if (*nptr && !*endptr) {
      return Acceptable;
   }
   return Invalid;
}

AllIntValidator aiv;

//QFont fixed;

QWidget *getWidgetParent() {
   if (mainWindow == NULL) {
      mainWindow = QApplication::activeWindow();
   }
   return mainWindow;
}

/*
 * Set the title of the emulator window
 */
void setEmulatorTitle(const char *title) {
   msp430Dlg->setWindowTitle(title);
}

//convert a register number into a control ID for the register's display
QLineEdit *regToControl(unsigned int reg) {
   switch (reg) {
      case PC:
         return msp430Dlg->QPC;
      case SP:
         return msp430Dlg->QSP;
      case SR:
         return msp430Dlg->QSR;
      case CG:
         return msp430Dlg->QCG;
      case R4:
         return msp430Dlg->QR4;
      case R5:
         return msp430Dlg->QR5;
      case R6:
         return msp430Dlg->QR6;
      case R7:
         return msp430Dlg->QR7;
      case R8:
         return msp430Dlg->QR8;
      case R9:
         return msp430Dlg->QR9;
      case R10:
         return msp430Dlg->QR10;
      case R11:
         return msp430Dlg->QR11;
      case R12:
         return msp430Dlg->QR12;
      case R13:
         return msp430Dlg->QR13;
      case R14:
         return msp430Dlg->QR14;
      case R15:
         return msp430Dlg->QR15;
   }
   return NULL;
}

//update the specified register display with the specified 
//value. Useful for updating register contents based on user
//input
void updateRegisterDisplay(int r) {
   static bool registersSet[MAX_REG + 1];
   static unsigned int current[MAX_REG + 1];
   QLineEdit *l = regToControl(r);
   if (l) {
      char buf[16];
      unsigned int rval = getRegisterValue(r);
      ::qsnprintf(buf, sizeof(buf), "0x%04X", rval & 0xffff);
      QString v(buf);
      if (registersSet[r]) {
         if (rval != current[r]) {
            current[r] = rval;
            l->setStyleSheet("QLineEdit{color: red;}");
         }
         else {
            l->setStyleSheet("QLineEdit{color: black;}");
         }
      }
      else {
         registersSet[r] = true;
         current[r] = rval;
      }
      l->setText(v);
   }
}

//get an int value from Edit box string
//assumes value is a valid hex string
unsigned int getEditBoxInt(QLineEdit *l) {
   return strtoul(l->text().toAscii().data(), NULL, 0);
}

//display a single line input box with the given title, prompt
//and initial data value.  If the user does not cancel, their
//data is placed into the global variable "value"
char *inputBox(const char *boxTitle, const char *msg, const char *init) {
   static char value[80]; //value entered by the user
   bool ok;
   QString text = QInputDialog::getText(getWidgetParent(), boxTitle,
                              msg, QLineEdit::Normal, init, &ok);
   if (ok && !text.isEmpty()) {
      ::qstrncpy(value, text.toAscii().data(), sizeof(value));
      return value;
   }
   return NULL;
}

//display a single line input box with the given title, prompt
//and initial data value.  If the user does not cancel, their
//data is placed into the global variable "value"
bool do_getsn(bytevec_t &bv, unsigned int max, const char *console) {
   CustomInputDialog id(console, max, getWidgetParent());
   restoreCursor();
   int rc = id.exec();
   showWaitCursor();
   if (rc == QDialog::Accepted) {
      bv = id.data;
      return true;
   }
   return false;
}

char *getSaveFileName(const char *title, char *fileName, int nameSize, const char *filter) {
   if (fileName == NULL || nameSize == 0) {
      return NULL;
   }
   QString f = QFileDialog::getSaveFileName(getWidgetParent(), title,
                                            QString(), filter);
   if (!f.isNull()) {
      ::qstrncpy(fileName, f.toAscii().data(), nameSize);
      return fileName;
   }
   return NULL;
}

char *getDirectoryName(const char *title, char *dirName, int nameSize) {
   if (dirName == NULL || nameSize == 0) {
      return NULL;
   }

   QString dir = QFileDialog::getExistingDirectory(getWidgetParent(), title,
                                                 QString(), QFileDialog::ShowDirsOnly
                                                 | QFileDialog::DontResolveSymlinks);   
   
