cseagle/msp430emu/msp430emu_ui_qt.cpp
   if (!dir.isNull()) {
      ::qstrncpy(dirName, dir.toAscii().data(), nameSize);
      return dirName;
   }
   return NULL;
}

void showErrorMessage(const char *msg) {
   QMessageBox::warning(getWidgetParent(), "Error", msg);
}

//ask user for an file name and load the file into memory
//at the specified address
char *getOpenFileName(const char *title, char *fileName, int nameLen, const char *filter, char *initDir) {
   if (fileName == NULL || nameLen == 0) {
      return NULL;
   }
   QString f = QFileDialog::getOpenFileName(getWidgetParent(), title,
                                            initDir, filter);
   if (!f.isNull()) {
      ::qstrncpy(fileName, f.toAscii().data(), nameLen);
      return fileName;
   }
   return NULL;
}

static void setMemValues(unsigned int addr, char *v, unsigned int sz) {
   char *ptr;
   while ((ptr = strchr(v, ' ')) != NULL) {
      *ptr++ = 0;
      if (strlen(v)) {
         writeMem(addr, strtoul(v, NULL, 16), sz);
         addr += sz;
      }
      v = ptr;
   }
   if (strlen(v)) {
      writeMem(addr, strtoul(v, NULL, 16), sz);
   }
}

void SetMemoryDialog::do_ok() {
   char *ea = mem_start->text().toAscii().data();
   unsigned int addr = strtoul(ea, 0, 0);
   char *v = mem_values->text().toAscii().data();

   if (type_file->isChecked()) {
      memLoadFile(addr);
   }
   else if (type_byte->isChecked()) {
      setMemValues(addr, v, SIZE_BYTE);
   }
   else if (type_word->isChecked()) {
      setMemValues(addr, v, SIZE_WORD);
   }
   else if (type_ascii->isChecked() || type_asciiz->isChecked()) {
      while (*v) writeMem(addr++, *v++, SIZE_BYTE);
      if (type_asciiz->isChecked()) writeMem(addr, 0, SIZE_BYTE);
   }
   accept();
}

SetMemoryDialog::SetMemoryDialog(QWidget *parent) : QDialog(parent) {
   setSizeGripEnabled(false);
   setModal(true);

   QLabel *address = new QLabel("Start address:");
   QLabel *values = new QLabel("Space separated values:");

   QPushButton *set_ok = new QPushButton("&OK");
   set_ok->setAutoDefault(true);
   set_ok->setDefault(true);
   
   QPushButton *set_cancel = new QPushButton("&Cancel");
   set_cancel->setAutoDefault(true);
   
   QHBoxLayout *buttonLayout = new QHBoxLayout();
   buttonLayout->setSpacing(2);
   buttonLayout->setContentsMargins(4, 4, 4, 4);
   buttonLayout->addStretch(1);
   buttonLayout->addWidget(set_ok);
   buttonLayout->addWidget(set_cancel);
   buttonLayout->addStretch(1);
   
   QWidget *buttonPanel = new QWidget();
   buttonPanel->setLayout(buttonLayout);
   
   type_dword = new QRadioButton("32 bit hex");
   type_word = new QRadioButton("16 bit hex");
   type_byte = new QRadioButton("8 bit hex");
   type_ascii = new QRadioButton("ASCII w/o null");
   type_asciiz = new QRadioButton("ASCII w/ null");
   type_file = new QRadioButton("Load from file");   
   
   QGridLayout *gl = new QGridLayout();
   gl->setSpacing(2);
   gl->setContentsMargins(4, 4, 4, 4);
   
   gl->addWidget(type_byte, 0, 0);
   gl->addWidget(type_ascii, 0, 1);
   gl->addWidget(type_word, 1, 0);
   gl->addWidget(type_asciiz, 1, 1);
   gl->addWidget(type_dword, 2, 0);
   gl->addWidget(type_file, 2, 1);
   
   QGroupBox *groupBox = new QGroupBox("Data type");
   groupBox->setLayout(gl);
   
   char buf[32];
   ::qsnprintf(buf, sizeof(buf), "0x%08X", (unsigned int)get_screen_ea());
   mem_start = new QLineEdit(buf);
   mem_start->setValidator(&aiv);
   mem_values = new QLineEdit(this);

   address->setBuddy(mem_start);
   values->setBuddy(mem_values);
   
   type_byte->setChecked(true);
   
   QVBoxLayout *vbl = new QVBoxLayout();
   vbl->setSpacing(2);
   vbl->setContentsMargins(4, 4, 4, 4);
   vbl->addWidget(address);
   vbl->addWidget(mem_start);
   vbl->addWidget(new QWidget());
   vbl->addWidget(new QWidget());
   
   QWidget *leftPanel = new QWidget();
   leftPanel->setLayout(vbl);
   
   QHBoxLayout *hbl = new QHBoxLayout();
   hbl->setSpacing(2);
   hbl->setContentsMargins(4, 4, 4, 4);
   hbl->addWidget(leftPanel);
   hbl->addWidget(groupBox);
   
   QWidget *topPanel = new QWidget();
   topPanel->setLayout(hbl);
   
   QVBoxLayout *mainLayout = new QVBoxLayout();
   mainLayout->setSpacing(2);
   mainLayout->setContentsMargins(4, 4, 4, 4);
   mainLayout->addWidget(topPanel);
   mainLayout->addWidget(values);
   mainLayout->addWidget(mem_values);
   mainLayout->addWidget(buttonPanel);
   
   setLayout(mainLayout);
      
   connect(set_ok, SIGNAL(clicked()), this, SLOT(do_ok()));
   connect(set_cancel, SIGNAL(clicked()), this, SLOT(reject()));
   
   setWindowTitle("Set Memory Values");   
}

void showInformationMessage(const char *title, const char *msg) {
   QMessageBox::information(getWidgetParent(), title, msg);
}

void showWaitCursor() {
   QApplication::setOverrideCursor(QCursor(Qt::WaitCursor));
}

void restoreCursor() {
   QApplication::restoreOverrideCursor();
}

static QString &formatReg(QString &qs, const char *format, unsigned int val) {
   char buf[32];
   ::qsnprintf(buf, sizeof(buf), format, val);
   qs = buf;
   return qs;
}

void changeReg(int reg, const QString &val) {
   setRegisterValue(reg, strtoul(val.toAscii().data(), NULL, 0));
}

void MSP430Dialog::changePC() {
   changeReg(PC, QPC->text());
}

void MSP430Dialog::changeSP() {
   changeReg(SP, QSP->text());
}

void MSP430Dialog::changeSR() {
   changeReg(SR, QSR->text());
}

void MSP430Dialog::changeCG() {
   changeReg(CG, QCG->text());
}

void MSP430Dialog::changeR4() {
   changeReg(R4, QR4->text());
}

void MSP430Dialog::changeR5() {
   changeReg(R5, QR5->text());
}

void MSP430Dialog::changeR6() {
   changeReg(R6, QR6->text());
}

void MSP430Dialog::changeR7() {
   changeReg(R7, QR7->text());
}

void MSP430Dialog::changeR8() {
   changeReg(R8, QR8->text());
}

void MSP430Dialog::changeR9() {
   changeReg(R9, QR9->text());
}

void MSP430Dialog::changeR10() {
   changeReg(R10, QR10->text());
}

void MSP430Dialog::changeR11() {
   changeReg(R11, QR11->text());
}

void MSP430Dialog::changeR12() {
   changeReg(R12, QR12->text());
}

void MSP430Dialog::changeR13() {
   changeReg(R13, QR13->text());
}

void MSP430Dialog::changeR14() {
   changeReg(R14, QR14->text());
}

void MSP430Dialog::changeR15() {
   changeReg(R15, QR15->text());
}

//ask user for an address range and dump that address range
//to a user named file;
void MSP430Dialog::dumpRange() {
   ::dumpRange();
}

void MSP430Dialog::reset() {
   doReset();
}

void MSP430Dialog::breakOnSyscalls() {
   if (getBreakMode()) {
      emulateBreakOnSyscallsAction->setChecked(false);
   }
   else {
      emulateBreakOnSyscallsAction->setChecked(true);
   }
   setBreakMode(!getBreakMode());
}

void MSP430Dialog::microCorruptionBugs() {
   if (getBugMode()) {
      emulateMicrocorruptionBugModeAction->setChecked(false);
   }
   else {
      emulateMicrocorruptionBugModeAction->setChecked(true);
   }
   setBugMode(!getBugMode());
}

void MSP430Dialog::trackExec() {
   if (getTracking()) {
      emulateTrack_fetched_bytesAction->setChecked(false);
   }
   else {
      emulateTrack_fetched_bytesAction->setChecked(true);
   }
   setTracking(!getTracking());
}

