cseagle/msp430emu/msp430emu_ui_qt.cpp
void MSP430Dialog::traceExec() {
   if (getTracing()) {
      emulateTrace_executionAction->setChecked(false);
      closeTrace();
   }
   else {
      emulateTrace_executionAction->setChecked(true);
      openTraceFile();
   }
   setTracing(!getTracing()); 
}

void MSP430Dialog::setBreak() {
   setBreakpoint();
}

void MSP430Dialog::clearBreak() {
   clearBreakpoint();
}

void MSP430Dialog::hideEmu() {
   msp430Dlg->hide();
}

void MSP430Dialog::step() {
   stepOne();
}

void MSP430Dialog::skip() {
   ::skip();
}

void MSP430Dialog::run() {
   BREAK->setEnabled(true);
   ::run();
   BREAK->setEnabled(false);
}

void MSP430Dialog::doBreak() {
   shouldBreak = 1;
}

void MSP430Dialog::runCursor() {
   BREAK->setEnabled(true);
   ::runToCursor();
   BREAK->setEnabled(false);
}

void MSP430Dialog::jumpCursor() {
   ::jumpToCursor();
}

//ask the user for space separated data and push it onto the
//stack in right to left order as a C function would
void MSP430Dialog::pushData() {
   ::pushData();
}

void MSP430Dialog::setMemory() {
   SetMemoryDialog mem(this);
   mem.exec();
}

#define MSP430_WINDOW_FLAGS Qt::CustomizeWindowHint | \
                         Qt::WindowTitleHint | \
                         Qt::WindowMinimizeButtonHint | \
                         Qt::WindowCloseButtonHint | \
                         Qt::Tool
MSP430Dialog::MSP430Dialog(QWidget *parent) : QMainWindow(parent, MSP430_WINDOW_FLAGS) {   
   QAction *fileDumpAction = new QAction("Dump", this);
   QAction *fileCloseAction = new QAction("Close", this);   
   QAction *viewResetAction = new QAction("Reset", this);
   QAction *emulateSet_breakpointAction = new QAction("Set breakpoint...", this);
   QAction *emulateRemove_breakpointAction = new QAction("Remove breakpoint...", this);

   emulateBreakOnSyscallsAction = new QAction("Break on system call", this);
   emulateBreakOnSyscallsAction->setCheckable(true);

   emulateMicrocorruptionBugModeAction = new QAction("Emulate microcorruption bugs", this);
   emulateMicrocorruptionBugModeAction->setCheckable(true);

   emulateTrack_fetched_bytesAction = new QAction("Track fetched bytes", this);
   emulateTrack_fetched_bytesAction->setCheckable(true);

   emulateTrace_executionAction = new QAction("Trace execution", this);
   emulateTrace_executionAction->setCheckable(true);

   QPC = new QLineEdit();
   QPC->setValidator(&aiv);
   QFont font1;
   font1.setFamily(QString::fromUtf8("Courier"));
   QPC->setFont(font1);
   QPC->setFixedWidth(70);

   QSP = new QLineEdit();
   QSP->setValidator(&aiv);
   QSP->setFont(font1);
   QSP->setFixedWidth(70);

   QSR = new QLineEdit();
   QSR->setValidator(&aiv);
   QSR->setFont(font1);
   QSR->setFixedWidth(70);

   QCG = new QLineEdit();
   QCG->setValidator(&aiv);
   QCG->setFont(font1);
   QCG->setFixedWidth(70);

   QR9 = new QLineEdit();
   QR9->setValidator(&aiv);
   QR9->setFont(font1);
   QR9->setFixedWidth(70);

   QR6 = new QLineEdit();
   QR6->setValidator(&aiv);
   QR6->setFont(font1);
   QR6->setFixedWidth(70);

   QR7 = new QLineEdit();
   QR7->setValidator(&aiv);
   QR7->setFont(font1);
   QR7->setFixedWidth(70);

   QR5 = new QLineEdit();
   QR5->setValidator(&aiv);
   QR5->setFont(font1);
   QR5->setFixedWidth(70);

   QR4 = new QLineEdit();
   QR4->setValidator(&aiv);
   QR4->setFont(font1);
   QR4->setFixedWidth(70);

   QR8 = new QLineEdit();
   QR8->setValidator(&aiv);
   QR8->setFont(font1);
   QR8->setFixedWidth(70);

   QR10 = new QLineEdit();
   QR10->setValidator(&aiv);
   QR10->setFont(font1);
   QR10->setFixedWidth(70);

   QR11 = new QLineEdit();
   QR11->setValidator(&aiv);
   QR11->setFont(font1);
   QR11->setFixedWidth(70);

   QR12 = new QLineEdit();
   QR12->setValidator(&aiv);
   QR12->setFont(font1);
   QR12->setFixedWidth(70);

   QR13 = new QLineEdit();
   QR13->setValidator(&aiv);
   QR13->setFont(font1);
   QR13->setFixedWidth(70);

   QR14 = new QLineEdit();
   QR14->setValidator(&aiv);
   QR14->setFont(font1);
   QR14->setFixedWidth(70);

   QR15 = new QLineEdit();
   QR15->setValidator(&aiv);
   QR15->setFont(font1);
   QR15->setFixedWidth(70);

   QFormLayout *left = new QFormLayout();
   left->setSpacing(2);
   left->setContentsMargins(4, 4, 4, 4);
   //add label/Edit pairs
   left->addRow("PC", QPC);
   left->addRow("R4", QR4);
   left->addRow("R8", QR8);
   left->addRow("R12", QR12);

   QWidget *leftPanel = new QWidget();
   leftPanel->setLayout(left);

   QFormLayout *c1 = new QFormLayout();
   c1->setSpacing(2);
   c1->setContentsMargins(4, 4, 4, 4);
   //add label/Edit pairs
   c1->addRow("SP", QSP);
   c1->addRow("R5", QR5);
   c1->addRow("R9", QR9);
   c1->addRow("R13", QR13);

   QWidget *c1Panel = new QWidget();
   c1Panel->setLayout(c1);

   QFormLayout *c2 = new QFormLayout();
   c2->setSpacing(2);
   c2->setContentsMargins(4, 4, 4, 4);
   //add label/Edit pairs
   c2->addRow("SR", QSR);
   c2->addRow("R6", QR6);
   c2->addRow("R10", QR10);
   c2->addRow("R14", QR14);

   QWidget *c2Panel = new QWidget();
   c2Panel->setLayout(c2);

   QFormLayout *right = new QFormLayout();
   right->setSpacing(2);
   right->setContentsMargins(4, 4, 4, 4);
   right->addRow("CG", QCG);
   right->addRow("R7", QR7);
   right->addRow("R11", QR11);
   right->addRow("R15", QR15);

   QWidget *rightPanel = new QWidget();
   rightPanel->setLayout(right);

   QHBoxLayout *regBox = new QHBoxLayout();  //for registers
   regBox->setSpacing(2);
   regBox->setContentsMargins(4, 4, 4, 4);
   regBox->addWidget(leftPanel);
   regBox->addWidget(c1Panel);
   regBox->addWidget(c2Panel);
   regBox->addWidget(rightPanel);

   QGroupBox *REGISTERS = new QGroupBox("Registers");
   REGISTERS->setLayout(regBox);

   QPushButton *SET_MEMORY = new QPushButton("Set Memory");
   QPushButton *RUN = new QPushButton("Run");
   BREAK = new QPushButton("Break");
   QPushButton *SKIP = new QPushButton("Skip");
   QPushButton *STEP = new QPushButton("Step");
   QPushButton *RUN_TO_CURSOR = new QPushButton("Run to cursor");
   QPushButton *PUSH_DATA = new QPushButton("Push data");
   QPushButton *JUMP_TO_CURSOR = new QPushButton("Jump to cursor");
   
