cseagle/msp430emu/msp430emu_ui_qt.cpp
   QGridLayout *gl = new QGridLayout(); //for buttons
   gl->setSpacing(2);
   gl->setContentsMargins(4, 4, 4, 4);
   //add buttons
   gl->addWidget(STEP, 0, 0);
   gl->addWidget(RUN_TO_CURSOR, 0, 1);
   gl->addWidget(SKIP, 1, 0);
   gl->addWidget(JUMP_TO_CURSOR, 1, 1);
   gl->addWidget(RUN, 2, 0);
   gl->addWidget(BREAK, 2, 1);
   gl->addWidget(SET_MEMORY, 4, 0);
   gl->addWidget(PUSH_DATA, 4, 1);
   
   QWidget *buttons = new QWidget();
   buttons->setLayout(gl);

   QHBoxLayout *hbl = new QHBoxLayout();
   hbl->setSpacing(2);
   hbl->setContentsMargins(4, 4, 4, 4);
   hbl->addWidget(REGISTERS);
   hbl->addWidget(buttons);

   QWidget *central = new QWidget(this);
   central->setLayout(hbl);
   
   setCentralWidget(central);

   QToolBar *toolBar = new QToolBar();
   toolBar->setMovable(false);

   QMenu *File = new QMenu("File", this);
   QMenu *Edit = new QMenu("Edit", this);
   QMenu *View = new QMenu("View", this);
   QMenu *Emulate = new QMenu("Emulate", this);

   addToolBar(toolBar);
      
   setTabOrder(QPC, QSP);
   setTabOrder(QSP, QSR);
   setTabOrder(QSR, QCG);
   setTabOrder(QCG, QR4);
   setTabOrder(QR4, QR5);
   setTabOrder(QR5, QR6);
   setTabOrder(QR6, QR7);
   setTabOrder(QR7, QR8);
   setTabOrder(QR8, QR9);
   setTabOrder(QR9, QR10);
   setTabOrder(QR10, QR11);
   setTabOrder(QR11, QR12);
   setTabOrder(QR12, QR13);
   setTabOrder(QR13, QR14);
   setTabOrder(QR14, QR15);
   setTabOrder(QR15, STEP);
   setTabOrder(STEP, RUN_TO_CURSOR);
   setTabOrder(RUN_TO_CURSOR, SKIP);
   setTabOrder(SKIP, JUMP_TO_CURSOR);
   setTabOrder(JUMP_TO_CURSOR, RUN);
   setTabOrder(RUN, SET_MEMORY);
   setTabOrder(SET_MEMORY, PUSH_DATA);

   toolBar->addAction(File->menuAction());
   toolBar->addAction(Edit->menuAction());
   toolBar->addAction(View->menuAction());
   toolBar->addAction(Emulate->menuAction());

   File->addAction(fileDumpAction);
   File->addSeparator();
   File->addAction(fileCloseAction);

   View->addAction(viewResetAction);
   Emulate->addAction(emulateSet_breakpointAction);
   Emulate->addAction(emulateRemove_breakpointAction);
   Emulate->addSeparator();
   Emulate->addAction(emulateBreakOnSyscallsAction);
   Emulate->addAction(emulateMicrocorruptionBugModeAction);
   Emulate->addSeparator();
   Emulate->addAction(emulateTrack_fetched_bytesAction);
   Emulate->addAction(emulateTrace_executionAction);
   
   connect(STEP, SIGNAL(clicked()), this, SLOT(step()));
   connect(SKIP, SIGNAL(clicked()), this, SLOT(skip()));
   connect(RUN, SIGNAL(clicked()), this, SLOT(run()));
   connect(BREAK, SIGNAL(clicked()), this, SLOT(doBreak()));
   connect(RUN_TO_CURSOR, SIGNAL(clicked()), this, SLOT(runCursor()));
   connect(JUMP_TO_CURSOR, SIGNAL(clicked()), this, SLOT(jumpCursor()));
   connect(SET_MEMORY, SIGNAL(clicked()), this, SLOT(setMemory()));
   connect(PUSH_DATA, SIGNAL(clicked()), this, SLOT(pushData()));
   connect(QPC, SIGNAL(editingFinished()), this, SLOT(changePC()));
   connect(QSP, SIGNAL(editingFinished()), this, SLOT(changeSP()));
   connect(QSR, SIGNAL(editingFinished()), this, SLOT(changeSR()));
   connect(QCG, SIGNAL(editingFinished()), this, SLOT(changeCG()));
   connect(QR4, SIGNAL(editingFinished()), this, SLOT(changeR4()));
   connect(QR5, SIGNAL(editingFinished()), this, SLOT(changeR5()));
   connect(QR6, SIGNAL(editingFinished()), this, SLOT(changeR6()));
   connect(QR7, SIGNAL(editingFinished()), this, SLOT(changeR7()));
   connect(QR8, SIGNAL(editingFinished()), this, SLOT(changeR8()));
   connect(QR9, SIGNAL(editingFinished()), this, SLOT(changeR9()));
   connect(QR10, SIGNAL(editingFinished()), this, SLOT(changeR10()));
   connect(QR11, SIGNAL(editingFinished()), this, SLOT(changeR11()));
   connect(QR12, SIGNAL(editingFinished()), this, SLOT(changeR12()));
   connect(QR13, SIGNAL(editingFinished()), this, SLOT(changeR13()));
   connect(QR14, SIGNAL(editingFinished()), this, SLOT(changeR14()));
   connect(QR15, SIGNAL(editingFinished()), this, SLOT(changeR15()));

   connect(fileDumpAction, SIGNAL(triggered()), this, SLOT(dumpRange()));
   connect(fileCloseAction, SIGNAL(triggered()), this, SLOT(hideEmu()));
   connect(emulateSet_breakpointAction, SIGNAL(triggered()), this, SLOT(setBreak()));
   connect(emulateRemove_breakpointAction, SIGNAL(triggered()), this, SLOT(clearBreak()));
   connect(viewResetAction, SIGNAL(triggered()), this, SLOT(reset()));

   connect(emulateBreakOnSyscallsAction, SIGNAL(triggered()), this, SLOT(breakOnSyscalls()));
   connect(emulateMicrocorruptionBugModeAction, SIGNAL(triggered()), this, SLOT(microCorruptionBugs()));
   connect(emulateTrack_fetched_bytesAction, SIGNAL(triggered()), this, SLOT(trackExec()));
   connect(emulateTrace_executionAction, SIGNAL(triggered()), this, SLOT(traceExec()));

   setWindowTitle("msp430 Emulator");

}

bool createEmulatorWindow() {
   if (msp430Dlg == NULL) {
      msp430Dlg = new MSP430Dialog(getWidgetParent());
      setTitle();
      syncDisplay();
   }
   return true;
}

void destroyEmulatorWindow() {
   if (msp430Dlg) {
      msp430Dlg->close();
      delete msp430Dlg;
      msp430Dlg = NULL; 
   }
}

void displayEmulatorWindow() {
   if (msp430Dlg == NULL) {
      createEmulatorWindow();
   }
   msp430Dlg->show();
}

void CustomInputDialog::do_ok() {
   const char *v = inputText->text().toAscii().data();
   unsigned int dlen = inputText->text().length();

   if (hex_or_not->isChecked()) {
      unsigned int count = 0;      
      unsigned char *udata = (unsigned char *)::qalloc(dlen);
      unsigned int i = 0;
      unsigned char *p = udata;
      for (; i < dlen; i++) {
         if (!isspace(v[i])) {
            *p++ = (unsigned char)v[i];
         }
      }
      dlen = p - udata;
      i = 0;
      for (i = 0; i < dlen && count < _max; i += 2, count++) {
         if (sscanf(v + i, "%2hhx", udata + count) != 1) {
            QMessageBox::warning(getWidgetParent(), "Invalid input", "Invalid characters in hex input");            
            ::qfree(udata);
            return;
         }
      }
      data.append(udata, count);
      ::qfree(udata);   
   }
   else {
      if (dlen > _max) {
         dlen = _max;
      }
      data.append(v, dlen);
   }
   accept();
}

CustomInputDialog::CustomInputDialog(const char *console, unsigned int max, QWidget *parent) : _max(max), QDialog(parent) {
   setSizeGripEnabled(false);
   setModal(true);

   QPlainTextEdit *text = new QPlainTextEdit(console, this);
   text->setReadOnly(true);

   QLabel *label1 = new QLabel("The CPU has requested user input from the console. Below is the output displayed on the console.");
   QLabel *label2 = new QLabel("Enter input below:");
   
