cseagle/msp430emu/msp430emu_ui_qt.cpp
   hex_or_not = new QCheckBox("Check here if entering hex encoded input.", this);
   inputText = new QLineEdit(this);

   QPushButton *btn_send = new QPushButton("&send");
   btn_send->setAutoDefault(true);
   btn_send->setDefault(true);
   
   QPushButton *btn_wait = new QPushButton("&wait");
   btn_send->setAutoDefault(true);
   
   QHBoxLayout *buttonLayout = new QHBoxLayout();
   buttonLayout->setSpacing(2);
   buttonLayout->setContentsMargins(4, 4, 4, 4);
   buttonLayout->addStretch(1);
   buttonLayout->addWidget(btn_send);
   buttonLayout->addWidget(btn_wait);
   buttonLayout->addStretch(1);
   
   QWidget *buttonPanel = new QWidget();
   buttonPanel->setLayout(buttonLayout);
   
//   address->setBuddy(mem_start);
//   values->setBuddy(mem_values);

   QVBoxLayout *cbl = new QVBoxLayout();
   cbl->setSpacing(4);
   cbl->setContentsMargins(4, 4, 4, 4);
   cbl->addWidget(label2);
   cbl->addWidget(hex_or_not);
   
   QWidget *cbPanel = new QWidget();
   cbPanel->setLayout(cbl);   

   QHBoxLayout *hbl = new QHBoxLayout();
   hbl->setSpacing(2);
   hbl->setContentsMargins(4, 4, 4, 4);
   hbl->addWidget(inputText);
   hbl->addWidget(buttonPanel);
   
   QWidget *inputPanel = new QWidget();
   inputPanel->setLayout(hbl);   
   
   QVBoxLayout *vbl = new QVBoxLayout();
   vbl->setSpacing(4);
   vbl->setContentsMargins(8, 8, 8, 8);
   vbl->addWidget(label1);
   vbl->addWidget(text);
   vbl->addWidget(cbPanel);
   vbl->addWidget(inputPanel);

   setLayout(vbl);
      
   connect(btn_send, SIGNAL(clicked()), this, SLOT(do_ok()));
   connect(btn_wait, SIGNAL(clicked()), this, SLOT(reject()));
   
   setWindowTitle("IO interrupt triggered");   
}

